BUILD/doc/source/_static/soap_outputs/6.5.314.4301/deploy_action_simple_against_windows_computers_step_5_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <saved_actions>
          <saved_action>
            <comment>Created by PyTan v2.1.4</comment>
            <status>0</status>
            <expire_seconds>3300</expire_seconds>
            <name>API Deploy Distribute Tanium Standard Utilities</name>
            <distribute_seconds>0</distribute_seconds>
            <start_time></start_time>
            <public_flag>0</public_flag>
            <issue_count>0</issue_count>
            <policy_flag>0</policy_flag>
            <end_time></end_time>
            <issue_seconds>0</issue_seconds>
            <approved_flag>0</approved_flag>
            <id>-1</id>
            <target_group>
              <filters>
                <filter>
                  <not_flag>0</not_flag>
                  <value>.*Windows.*</value>
                  <operator>RegexMatch</operator>
                  <sensor>
                    <hash>45421433</hash>
                  </sensor>
                </filter>
              </filters>
            </target_group>
            <package_spec>
              <expire_seconds>3300</expire_seconds>
              <display_name>Distribute Tanium Standard Utilities</display_name>
              <name>Distribute Tanium Standard Utilities</name>
              <verify_expire_seconds>600</verify_expire_seconds>
              <verify_group_id>0</verify_group_id>
              <skip_lock_flag>0</skip_lock_flag>
              <last_update>2015-09-14T13:39:15</last_update>
              <hidden_flag>1</hidden_flag>
              <command>cmd /c cscript install-standard-utils.vbs "Tools\StdUtils"</command>
              <command_timeout>2700</command_timeout>
              <id>23</id>
              <verify_group>
                <id>0</id>
              </verify_group>
            </package_spec>
          </saved_action>
        </saved_actions>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>